Damme/LandLord/common/LPC175x_6x/LPC175x_6x.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             1         /*!< MPU present or not                               */
#define __NVIC_PRIO_BITS          5         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */


#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals           */
#include "system_LPC175x_6x.h"                 /* System Header                                      */


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/*------------- System Control (SC) ------------------------------------------*/
/** @brief System Control (SC) register structure definition */
typedef struct {
    __IO uint32_t FLASHCFG;               /* Flash Accelerator Module           */
    uint32_t RESERVED0[31];
    __IO uint32_t PLL0CON;                /* Clocking and Power Control         */
    __IO uint32_t PLL0CFG;
    __I  uint32_t PLL0STAT;
    __O  uint32_t PLL0FEED;
    uint32_t RESERVED1[4];
    __IO uint32_t PLL1CON;
    __IO uint32_t PLL1CFG;
    __I  uint32_t PLL1STAT;
    __O  uint32_t PLL1FEED;
    uint32_t RESERVED2[4];
    __IO uint32_t PCON;
    __IO uint32_t PCONP;
    uint32_t RESERVED3[15];
    __IO uint32_t CCLKCFG;
    __IO uint32_t USBCLKCFG;
    __IO uint32_t CLKSRCSEL;
    __IO uint32_t CANSLEEPCLR;
    __IO uint32_t CANWAKEFLAGS;
    uint32_t RESERVED4[10];
    __IO uint32_t EXTINT;                 /* External Interrupts                */
    uint32_t RESERVED5;
    __IO uint32_t EXTMODE;
    __IO uint32_t EXTPOLAR;
    uint32_t RESERVED6[12];
    __IO uint32_t RSID;                   /* Reset                              */
    uint32_t RESERVED7[7];
    __IO uint32_t SCS;                    /* Syscon Miscellaneous Registers     */
    __IO uint32_t IRCTRIM;                /* Clock Dividers                     */
    __IO uint32_t PCLKSEL0;
    __IO uint32_t PCLKSEL1;
    uint32_t RESERVED8[4];
    __IO uint32_t USBIntSt;               /* USB Device/OTG Interrupt Register  */
    __IO uint32_t DMAREQSEL;
    __IO uint32_t CLKOUTCFG;              /* Clock Output Configuration         */
} LPC_SC_TypeDef;

/*------------- Pin Connect Block (PINCON) -----------------------------------*/
/** @brief Pin Connect Block (PINCON) register structure definition */
typedef struct {
    __IO uint32_t PINSEL0;
    __IO uint32_t PINSEL1;
    __IO uint32_t PINSEL2;
    __IO uint32_t PINSEL3;
    __IO uint32_t PINSEL4;
    __IO uint32_t PINSEL5;
    __IO uint32_t PINSEL6;
    __IO uint32_t PINSEL7;
    __IO uint32_t PINSEL8;
    __IO uint32_t PINSEL9;
    __IO uint32_t PINSEL10;
    uint32_t RESERVED0[5]; // .....
    __IO uint32_t PINMODE0;
    __IO uint32_t PINMODE1;
    __IO uint32_t PINMODE2;
    __IO uint32_t PINMODE3;
    __IO uint32_t PINMODE4;
    __IO uint32_t PINMODE5;
    __IO uint32_t PINMODE6;
    __IO uint32_t PINMODE7;
    __IO uint32_t PINMODE8;
    __IO uint32_t PINMODE9;
    __IO uint32_t PINMODE_OD0;
    __IO uint32_t PINMODE_OD1;
    __IO uint32_t PINMODE_OD2;
    __IO uint32_t PINMODE_OD3;
    __IO uint32_t PINMODE_OD4;
    __IO uint32_t I2CPADCFG;
} LPC_PINCON_TypeDef;

/*------------- General Purpose Input/Output (GPIO) --------------------------*/
/** @brief General Purpose Input/Output (GPIO) register structure definition */
typedef struct {
    union {
        __IO uint32_t DIR;
        struct {
            __IO uint16_t DIRL;
            __IO uint16_t DIRH;
        };
        struct {
            __IO uint8_t  DIR0;
            __IO uint8_t  DIR1;
            __IO uint8_t  DIR2;
            __IO uint8_t  DIR3;
        };
    };
    uint32_t RESERVED0[3];
    union {
        __IO uint32_t MASK;
        struct {
            __IO uint16_t MASKL;
            __IO uint16_t MASKH;
        };
        struct {
            __IO uint8_t  MASK0;
            __IO uint8_t  MASK1;
            __IO uint8_t  MASK2;
            __IO uint8_t  MASK3;
        };
    };
    union {
        __IO uint32_t PIN;
        struct {
            __IO uint16_t PINL;
            __IO uint16_t PINH;
        };
        struct {
            __IO uint8_t  PIN0;
            __IO uint8_t  PIN1;
            __IO uint8_t  PIN2;
            __IO uint8_t  PIN3;
        };
    };
    union {
        __IO uint32_t SET;
        struct {
            __IO uint16_t SETL;
            __IO uint16_t SETH;
        };
        struct {
            __IO uint8_t  SET0;
            __IO uint8_t  SET1;
            __IO uint8_t  SET2;
            __IO uint8_t  SET3;
        };
    };
    union {
        __O  uint32_t CLR;
        struct {
            __O  uint16_t CLRL;
            __O  uint16_t CLRH;
        };
        struct {
            __O  uint8_t  CLR0;
            __O  uint8_t  CLR1;
            __O  uint8_t  CLR2;
            __O  uint8_t  CLR3;
        };
    };
} LPC_GPIO_TypeDef;

/** @brief General Purpose Input/Output interrupt (GPIOINT) register structure definition */
typedef struct {
    __I  uint32_t IntStatus;
    __I  uint32_t IO0IntStatR;
    __I  uint32_t IO0IntStatF;
    __O  uint32_t IO0IntClr;
    __IO uint32_t IO0IntEnR;
    __IO uint32_t IO0IntEnF;
    uint32_t RESERVED0[3];
    __I  uint32_t IO2IntStatR;
    __I  uint32_t IO2IntStatF;
    __O  uint32_t IO2IntClr;
    __IO uint32_t IO2IntEnR;
    __IO uint32_t IO2IntEnF;
} LPC_GPIOINT_TypeDef;

/*------------- Timer (TIM) --------------------------------------------------*/
/** @brief Timer (TIM) register structure definition */
typedef struct {
    __IO uint32_t IR;
    __IO uint32_t TCR;
    __IO uint32_t TC;
    __IO uint32_t PR;
    __IO uint32_t PC;
    __IO uint32_t MCR;
    __IO uint32_t MR0;
    __IO uint32_t MR1;
    __IO uint32_t MR2;
    __IO uint32_t MR3;
    __IO uint32_t CCR;
    __I  uint32_t CR0;
    __I  uint32_t CR1;
    uint32_t RESERVED0[2];
    __IO uint32_t EMR;
    uint32_t RESERVED1[12];
    __IO uint32_t CTCR;
} LPC_TIM_TypeDef;

/*------------- Pulse-Width Modulation (PWM) ---------------------------------*/
/** @brief Pulse-Width Modulation (PWM) register structure definition */
typedef struct {
    __IO uint32_t IR;
    __IO uint32_t TCR;
    __IO uint32_t TC;
    __IO uint32_t PR;
    __IO uint32_t PC;
    __IO uint32_t MCR;
    __IO uint32_t MR0;
    __IO uint32_t MR1;
    __IO uint32_t MR2;
    __IO uint32_t MR3;
    __IO uint32_t CCR;
    __I  uint32_t CR0;
    __I  uint32_t CR1;
    __I  uint32_t CR2;
    __I  uint32_t CR3;
    uint32_t RESERVED0;
    __IO uint32_t MR4;
    __IO uint32_t MR5;
    __IO uint32_t MR6;
    __IO uint32_t PCR;
    __IO uint32_t LER;
    uint32_t RESERVED1[7];
    __IO uint32_t CTCR;
} LPC_PWM_TypeDef;

/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
/** @brief  Universal Asynchronous Receiver Transmitter (UART) register structure definition */
typedef struct {
    union {
        __I  uint8_t  RBR;
        __O  uint8_t  THR;
        __IO uint8_t  DLL;
        uint32_t RESERVED0;
    };
    union {
        __IO uint8_t  DLM;
        __IO uint32_t IER;
    };
    union {
        __I  uint32_t IIR;
        __O  uint8_t  FCR;
    };
    __IO uint8_t  LCR;
    uint8_t  RESERVED1[7];
    __I  uint8_t  LSR;
    uint8_t  RESERVED2[7];
    __IO uint8_t  SCR;
    uint8_t  RESERVED3[3];
    __IO uint32_t ACR;
    __IO uint8_t  ICR;
    uint8_t  RESERVED4[3];
    __IO uint8_t  FDR;
    uint8_t  RESERVED5[7];
    __IO uint8_t  TER;
} LPC_UART_TypeDef;

/** @brief  Universal Asynchronous Receiver Transmitter 1 (UART1) register structure definition */
typedef struct {
    union {
        __I  uint8_t  RBR;
        __O  uint8_t  THR;
        __IO uint8_t  DLL;
        uint32_t RESERVED0;
    };
    union {
        __IO uint8_t  DLM;
        __IO uint32_t IER;
    };
    union {
        __I  uint32_t IIR;
        __O  uint8_t  FCR;
    };
    __IO uint8_t  LCR;
    uint8_t  RESERVED1[3];
    __IO uint8_t  MCR;
    uint8_t  RESERVED2[3];
    __I  uint8_t  LSR;
    uint8_t  RESERVED3[3];
    __I  uint8_t  MSR;
    uint8_t  RESERVED4[3];
    __IO uint8_t  SCR;
    uint8_t  RESERVED5[3];
    __IO uint32_t ACR;
    uint32_t RESERVED6;
    __IO uint32_t FDR;
    uint32_t RESERVED7;
    __IO uint8_t  TER;
    uint8_t  RESERVED8[27];
    __IO uint8_t  RS485CTRL;
    uint8_t  RESERVED9[3];
    __IO uint8_t  ADRMATCH;
    uint8_t  RESERVED10[3];
    __IO uint8_t  RS485DLY;
} LPC_UART1_TypeDef;

