Damme/LandLord/common/LPC175x_6x/LPC175x_6x.h
/*------------- Serial Peripheral Interface (SPI) ----------------------------*/
/** @brief  Serial Peripheral Interface (SPI) register structure definition */
typedef struct {
    __IO uint32_t SPCR;
    __I  uint32_t SPSR;
    __IO uint32_t SPDR;
    __IO uint32_t SPCCR;
    uint32_t RESERVED0[3];
    __IO uint32_t SPINT;
} LPC_SPI_TypeDef;

/*------------- Synchronous Serial Communication (SSP) -----------------------*/
/** @brief  Synchronous Serial Communication (SSP) register structure definition */
typedef struct {
    __IO uint32_t CR0;
    __IO uint32_t CR1;
    __IO uint32_t DR;
    __I  uint32_t SR;
    __IO uint32_t CPSR;
    __IO uint32_t IMSC;
    __IO uint32_t RIS;
    __IO uint32_t MIS;
    __IO uint32_t ICR;
    __IO uint32_t DMACR;
} LPC_SSP_TypeDef;

/*------------- Inter-Integrated Circuit (I2C) -------------------------------*/
/** @brief  Inter-Integrated Circuit (I2C) register structure definition */
typedef struct {
    __IO uint32_t I2CONSET;
    __I  uint32_t I2STAT;
    __IO uint32_t I2DAT;
    __IO uint32_t I2ADR0;
    __IO uint32_t I2SCLH;
    __IO uint32_t I2SCLL;
    __O  uint32_t I2CONCLR;
    __IO uint32_t MMCTRL;
    __IO uint32_t I2ADR1;
    __IO uint32_t I2ADR2;
    __IO uint32_t I2ADR3;
    __I  uint32_t I2DATA_BUFFER;
    __IO uint32_t I2MASK0;
    __IO uint32_t I2MASK1;
    __IO uint32_t I2MASK2;
    __IO uint32_t I2MASK3;
} LPC_I2C_TypeDef;

/*------------- Inter IC Sound (I2S) -----------------------------------------*/
/** @brief  Inter IC Sound (I2S) register structure definition */
typedef struct {
    __IO uint32_t I2SDAO;
    __IO uint32_t I2SDAI;
    __O  uint32_t I2STXFIFO;
    __I  uint32_t I2SRXFIFO;
    __I  uint32_t I2SSTATE;
    __IO uint32_t I2SDMA1;
    __IO uint32_t I2SDMA2;
    __IO uint32_t I2SIRQ;
    __IO uint32_t I2STXRATE;
    __IO uint32_t I2SRXRATE;
    __IO uint32_t I2STXBITRATE;
    __IO uint32_t I2SRXBITRATE;
    __IO uint32_t I2STXMODE;
    __IO uint32_t I2SRXMODE;
} LPC_I2S_TypeDef;

/*------------- Repetitive Interrupt Timer (RIT) -----------------------------*/
/** @brief  Repetitive Interrupt Timer (RIT) register structure definition */
typedef struct {
    __IO uint32_t RICOMPVAL;
    __IO uint32_t RIMASK;
    __IO uint8_t  RICTRL;
    uint8_t  RESERVED0[3];
    __IO uint32_t RICOUNTER;
} LPC_RIT_TypeDef;

/*------------- Real-Time Clock (RTC) ----------------------------------------*/
/** @brief  Real-Time Clock (RTC) register structure definition */
typedef struct {
    __IO uint8_t  ILR;
    uint8_t  RESERVED0[7];
    __IO uint8_t  CCR;
    uint8_t  RESERVED1[3];
    __IO uint8_t  CIIR;
    uint8_t  RESERVED2[3];
    __IO uint8_t  AMR;
    uint8_t  RESERVED3[3];
    __I  uint32_t CTIME0;
    __I  uint32_t CTIME1;
    __I  uint32_t CTIME2;
    __IO uint8_t  SEC;
    uint8_t  RESERVED4[3];
    __IO uint8_t  MIN;
    uint8_t  RESERVED5[3];
    __IO uint8_t  HOUR;
    uint8_t  RESERVED6[3];
    __IO uint8_t  DOM;
    uint8_t  RESERVED7[3];
    __IO uint8_t  DOW;
    uint8_t  RESERVED8[3];
    __IO uint16_t DOY;
    uint16_t RESERVED9;
    __IO uint8_t  MONTH;
    uint8_t  RESERVED10[3];
    __IO uint16_t YEAR;
    uint16_t RESERVED11;
    __IO uint32_t CALIBRATION;
    __IO uint32_t GPREG0;
    __IO uint32_t GPREG1;
    __IO uint32_t GPREG2;
    __IO uint32_t GPREG3;
    __IO uint32_t GPREG4;
    __IO uint8_t  RTC_AUXEN;
    uint8_t  RESERVED12[3];
    __IO uint8_t  RTC_AUX;
    uint8_t  RESERVED13[3];
    __IO uint8_t  ALSEC;
    uint8_t  RESERVED14[3];
    __IO uint8_t  ALMIN;
    uint8_t  RESERVED15[3];
    __IO uint8_t  ALHOUR;
    uint8_t  RESERVED16[3];
    __IO uint8_t  ALDOM;
    uint8_t  RESERVED17[3];
    __IO uint8_t  ALDOW;
    uint8_t  RESERVED18[3];
    __IO uint16_t ALDOY;
    uint16_t RESERVED19;
    __IO uint8_t  ALMON;
    uint8_t  RESERVED20[3];
    __IO uint16_t ALYEAR;
    uint16_t RESERVED21;
} LPC_RTC_TypeDef;

/*------------- Watchdog Timer (WDT) -----------------------------------------*/
/** @brief  Watchdog Timer (WDT) register structure definition */
typedef struct {
    __IO uint8_t  WDMOD;
    uint8_t  RESERVED0[3];
    __IO uint32_t WDTC;
    __O  uint8_t  WDFEED;
    uint8_t  RESERVED1[3];
    __I  uint32_t WDTV;
    __IO uint32_t WDCLKSEL;
} LPC_WDT_TypeDef;

/*------------- Analog-to-Digital Converter (ADC) ---------------------------- CHANGED to be simmilar to 177x*/
/** @brief  Analog-to-Digital Converter (ADC) register structure definition */
typedef struct
{
  __IO uint32_t CR;                     /*!< Offset: 0x000       A/D Control Register (R/W) */
  __IO uint32_t GDR;                    /*!< Offset: 0x004       A/D Global Data Register (R/W) */
       uint32_t RESERVED0;
  __IO uint32_t INTEN;                  /*!< Offset: 0x00C       A/D Interrupt Enable Register (R/W) */
  __IO uint32_t DR[8];                  /*!< Offset: 0x010-0x02C A/D Channel 0..7 Data Register (R/W) */
  __I  uint32_t STAT;                   /*!< Offset: 0x030       A/D Status Register (R/ ) */
  __IO uint32_t ADTRM;
} LPC_ADC_TypeDef;

/*------------- Digital-to-Analog Converter (DAC) ----------------------------*/
/** @brief  Digital-to-Analog Converter (DAC) register structure definition */
typedef struct {
    __IO uint32_t DACR;
    __IO uint32_t DACCTRL;
    __IO uint16_t DACCNTVAL;
} LPC_DAC_TypeDef;

/*------------- Motor Control Pulse-Width Modulation (MCPWM) -----------------*/
/** @brief  Motor Control Pulse-Width Modulation (MCPWM) register structure definition */
typedef struct {
    __I  uint32_t MCCON;
    __O  uint32_t MCCON_SET;
    __O  uint32_t MCCON_CLR;
    __I  uint32_t MCCAPCON;
    __O  uint32_t MCCAPCON_SET;
    __O  uint32_t MCCAPCON_CLR;
    __IO uint32_t MCTIM0;
    __IO uint32_t MCTIM1;
    __IO uint32_t MCTIM2;
    __IO uint32_t MCPER0;
    __IO uint32_t MCPER1;
    __IO uint32_t MCPER2;
    __IO uint32_t MCPW0;
    __IO uint32_t MCPW1;
    __IO uint32_t MCPW2;
    __IO uint32_t MCDEADTIME;
    __IO uint32_t MCCCP;
    __IO uint32_t MCCR0;
    __IO uint32_t MCCR1;
    __IO uint32_t MCCR2;
    __I  uint32_t MCINTEN;
    __O  uint32_t MCINTEN_SET;
    __O  uint32_t MCINTEN_CLR;
    __I  uint32_t MCCNTCON;
    __O  uint32_t MCCNTCON_SET;
    __O  uint32_t MCCNTCON_CLR;
    __I  uint32_t MCINTFLAG;
    __O  uint32_t MCINTFLAG_SET;
    __O  uint32_t MCINTFLAG_CLR;
    __O  uint32_t MCCAP_CLR;
} LPC_MCPWM_TypeDef;

/*------------- Quadrature Encoder Interface (QEI) ---------------------------*/
/** @brief  Quadrature Encoder Interface (QEI) register structure definition */
typedef struct {
    __O  uint32_t QEICON;
    __I  uint32_t QEISTAT;
    __IO uint32_t QEICONF;
    __I  uint32_t QEIPOS;
    __IO uint32_t QEIMAXPOS;
    __IO uint32_t CMPOS0;
    __IO uint32_t CMPOS1;
    __IO uint32_t CMPOS2;
    __I  uint32_t INXCNT;
    __IO uint32_t INXCMP;
    __IO uint32_t QEILOAD;
    __I  uint32_t QEITIME;
    __I  uint32_t QEIVEL;
    __I  uint32_t QEICAP;
    __IO uint32_t VELCOMP;
    __IO uint32_t FILTER;
    uint32_t RESERVED0[998];
    __O  uint32_t QEIIEC;
    __O  uint32_t QEIIES;
    __I  uint32_t QEIINTSTAT;
    __I  uint32_t QEIIE;
    __O  uint32_t QEICLR;
    __O  uint32_t QEISET;
} LPC_QEI_TypeDef;

/*------------- Controller Area Network (CAN) --------------------------------*/
/** @brief  Controller Area Network Acceptance Filter RAM (CANAF_RAM)structure definition */
typedef struct {
    __IO uint32_t mask[512];              /* ID Masks                           */
} LPC_CANAF_RAM_TypeDef;

/** @brief  Controller Area Network Acceptance Filter(CANAF) register structure definition */
typedef struct {                        /* Acceptance Filter Registers        */
    __IO uint32_t AFMR;
    __IO uint32_t SFF_sa;
    __IO uint32_t SFF_GRP_sa;
    __IO uint32_t EFF_sa;
    __IO uint32_t EFF_GRP_sa;
    __IO uint32_t ENDofTable;
    __I  uint32_t LUTerrAd;
    __I  uint32_t LUTerr;
    __IO uint32_t FCANIE;
    __IO uint32_t FCANIC0;
    __IO uint32_t FCANIC1;
} LPC_CANAF_TypeDef;

/** @brief  Controller Area Network Central (CANCR) register structure definition */
typedef struct {                        /* Central Registers                  */
    __I  uint32_t CANTxSR;
    __I  uint32_t CANRxSR;
    __I  uint32_t CANMSR;
} LPC_CANCR_TypeDef;

