Damme/LandLord/common/LPC175x_6x/LPC175x_6x.h
/** @brief  Controller Area Network Controller (CAN) register structure definition */
typedef struct {                        /* Controller Registers               */
    __IO uint32_t MOD;
    __O  uint32_t CMR;
    __IO uint32_t GSR;
    __I  uint32_t ICR;
    __IO uint32_t IER;
    __IO uint32_t BTR;
    __IO uint32_t EWL;
    __I  uint32_t SR;
    __IO uint32_t RFS;
    __IO uint32_t RID;
    __IO uint32_t RDA;
    __IO uint32_t RDB;
    __IO uint32_t TFI1;
    __IO uint32_t TID1;
    __IO uint32_t TDA1;
    __IO uint32_t TDB1;
    __IO uint32_t TFI2;
    __IO uint32_t TID2;
    __IO uint32_t TDA2;
    __IO uint32_t TDB2;
    __IO uint32_t TFI3;
    __IO uint32_t TID3;
    __IO uint32_t TDA3;
    __IO uint32_t TDB3;
} LPC_CAN_TypeDef;

/*------------- General Purpose Direct Memory Access (GPDMA) -----------------*/
/** @brief  General Purpose Direct Memory Access (GPDMA) register structure definition */
typedef struct {                        /* Common Registers                   */
    __I  uint32_t DMACIntStat;
    __I  uint32_t DMACIntTCStat;
    __O  uint32_t DMACIntTCClear;
    __I  uint32_t DMACIntErrStat;
    __O  uint32_t DMACIntErrClr;
    __I  uint32_t DMACRawIntTCStat;
    __I  uint32_t DMACRawIntErrStat;
    __I  uint32_t DMACEnbldChns;
    __IO uint32_t DMACSoftBReq;
    __IO uint32_t DMACSoftSReq;
    __IO uint32_t DMACSoftLBReq;
    __IO uint32_t DMACSoftLSReq;
    __IO uint32_t DMACConfig;
    __IO uint32_t DMACSync;
} LPC_GPDMA_TypeDef;

/** @brief  General Purpose Direct Memory Access Channel (GPDMACH) register structure definition */
typedef struct {                        /* Channel Registers                  */
    __IO uint32_t DMACCSrcAddr;
    __IO uint32_t DMACCDestAddr;
    __IO uint32_t DMACCLLI;
    __IO uint32_t DMACCControl;
    __IO uint32_t DMACCConfig;
} LPC_GPDMACH_TypeDef;

/*------------- Universal Serial Bus (USB) -----------------------------------*/
/** @brief  Universal Serial Bus (USB) register structure definition */
typedef struct {
    __I  uint32_t HcRevision;             /* USB Host Registers                 */
    __IO uint32_t HcControl;
    __IO uint32_t HcCommandStatus;
    __IO uint32_t HcInterruptStatus;
    __IO uint32_t HcInterruptEnable;
    __IO uint32_t HcInterruptDisable;
    __IO uint32_t HcHCCA;
    __I  uint32_t HcPeriodCurrentED;
    __IO uint32_t HcControlHeadED;
    __IO uint32_t HcControlCurrentED;
    __IO uint32_t HcBulkHeadED;
    __IO uint32_t HcBulkCurrentED;
    __I  uint32_t HcDoneHead;
    __IO uint32_t HcFmInterval;
    __I  uint32_t HcFmRemaining;
    __I  uint32_t HcFmNumber;
    __IO uint32_t HcPeriodicStart;
    __IO uint32_t HcLSTreshold;
    __IO uint32_t HcRhDescriptorA;
    __IO uint32_t HcRhDescriptorB;
    __IO uint32_t HcRhStatus;
    __IO uint32_t HcRhPortStatus1;
    __IO uint32_t HcRhPortStatus2;
    uint32_t RESERVED0[40];
    __I  uint32_t Module_ID;

    __I  uint32_t OTGIntSt;               /* USB On-The-Go Registers            */
    __IO uint32_t OTGIntEn;
    __O  uint32_t OTGIntSet;
    __O  uint32_t OTGIntClr;
    __IO uint32_t OTGStCtrl;
    __IO uint32_t OTGTmr;
    uint32_t RESERVED1[58];

    __I  uint32_t USBDevIntSt;            /* USB Device Interrupt Registers     */
    __IO uint32_t USBDevIntEn;
    __O  uint32_t USBDevIntClr;
    __O  uint32_t USBDevIntSet;

    __O  uint32_t USBCmdCode;             /* USB Device SIE Command Registers   */
    __I  uint32_t USBCmdData;

    __I  uint32_t USBRxData;              /* USB Device Transfer Registers      */
    __O  uint32_t USBTxData;
    __I  uint32_t USBRxPLen;
    __O  uint32_t USBTxPLen;
    __IO uint32_t USBCtrl;
    __O  uint32_t USBDevIntPri;

    __I  uint32_t USBEpIntSt;             /* USB Device Endpoint Interrupt Regs */
    __IO uint32_t USBEpIntEn;
    __O  uint32_t USBEpIntClr;
    __O  uint32_t USBEpIntSet;
    __O  uint32_t USBEpIntPri;

    __IO uint32_t USBReEp;                /* USB Device Endpoint Realization Reg*/
    __O  uint32_t USBEpInd;
    __IO uint32_t USBMaxPSize;

    __I  uint32_t USBDMARSt;              /* USB Device DMA Registers           */
    __O  uint32_t USBDMARClr;
    __O  uint32_t USBDMARSet;
    uint32_t RESERVED2[9];
    __IO uint32_t USBUDCAH;
    __I  uint32_t USBEpDMASt;
    __O  uint32_t USBEpDMAEn;
    __O  uint32_t USBEpDMADis;
    __I  uint32_t USBDMAIntSt;
    __IO uint32_t USBDMAIntEn;
    uint32_t RESERVED3[2];
    __I  uint32_t USBEoTIntSt;
    __O  uint32_t USBEoTIntClr;
    __O  uint32_t USBEoTIntSet;
    __I  uint32_t USBNDDRIntSt;
    __O  uint32_t USBNDDRIntClr;
    __O  uint32_t USBNDDRIntSet;
    __I  uint32_t USBSysErrIntSt;
    __O  uint32_t USBSysErrIntClr;
    __O  uint32_t USBSysErrIntSet;
    uint32_t RESERVED4[15];

    union {
        __I  uint32_t I2C_RX;                 /* USB OTG I2C Registers              */
        __O  uint32_t I2C_TX;
    };
    __I  uint32_t I2C_STS;
    __IO uint32_t I2C_CTL;
    __IO uint32_t I2C_CLKHI;
    __O  uint32_t I2C_CLKLO;
    uint32_t RESERVED5[824];

    union {
        __IO uint32_t USBClkCtrl;             /* USB Clock Control Registers        */
        __IO uint32_t OTGClkCtrl;
    };
    union {
        __I  uint32_t USBClkSt;
        __I  uint32_t OTGClkSt;
    };
} LPC_USB_TypeDef;

/*------------- Ethernet Media Access Controller (EMAC) ----------------------*/
/** @brief  Ethernet Media Access Controller (EMAC) register structure definition */
typedef struct {
    __IO uint32_t MAC1;                   /* MAC Registers                      */
    __IO uint32_t MAC2;
    __IO uint32_t IPGT;
    __IO uint32_t IPGR;
    __IO uint32_t CLRT;
    __IO uint32_t MAXF;
    __IO uint32_t SUPP;
    __IO uint32_t TEST;
    __IO uint32_t MCFG;
    __IO uint32_t MCMD;
    __IO uint32_t MADR;
    __O  uint32_t MWTD;
    __I  uint32_t MRDD;
    __I  uint32_t MIND;
    uint32_t RESERVED0[2];
    __IO uint32_t SA0;
    __IO uint32_t SA1;
    __IO uint32_t SA2;
    uint32_t RESERVED1[45];
    __IO uint32_t Command;                /* Control Registers                  */
    __I  uint32_t Status;
    __IO uint32_t RxDescriptor;
    __IO uint32_t RxStatus;
    __IO uint32_t RxDescriptorNumber;
    __I  uint32_t RxProduceIndex;
    __IO uint32_t RxConsumeIndex;
    __IO uint32_t TxDescriptor;
    __IO uint32_t TxStatus;
    __IO uint32_t TxDescriptorNumber;
    __IO uint32_t TxProduceIndex;
    __I  uint32_t TxConsumeIndex;
    uint32_t RESERVED2[10];
    __I  uint32_t TSV0;
    __I  uint32_t TSV1;
    __I  uint32_t RSV;
    uint32_t RESERVED3[3];
    __IO uint32_t FlowControlCounter;
    __I  uint32_t FlowControlStatus;
    uint32_t RESERVED4[34];
    __IO uint32_t RxFilterCtrl;           /* Rx Filter Registers                */
    __IO uint32_t RxFilterWoLStatus;
    __IO uint32_t RxFilterWoLClear;
    uint32_t RESERVED5;
    __IO uint32_t HashFilterL;
    __IO uint32_t HashFilterH;
    uint32_t RESERVED6[882];
    __I  uint32_t IntStatus;              /* Module Control Registers           */
    __IO uint32_t IntEnable;
    __O  uint32_t IntClear;
    __O  uint32_t IntSet;
    uint32_t RESERVED7;
    __IO uint32_t PowerDown;
    uint32_t RESERVED8;
    __IO uint32_t Module_ID;
} LPC_EMAC_TypeDef;


#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_FLASH_BASE        (0x00000000UL)
#define LPC_RAM_BASE          (0x10000000UL)
#ifdef __LPC17XX_REV00
    #define LPC_AHBRAM0_BASE      (0x20000000UL)
    #define LPC_AHBRAM1_BASE      (0x20004000UL)
#else
    #define LPC_AHBRAM0_BASE      (0x2007C000UL)
    #define LPC_AHBRAM1_BASE      (0x20080000UL)
#endif
#define LPC_GPIO_BASE         (0x2009C000UL)
#define LPC_APB0_BASE         (0x40000000UL)
#define LPC_APB1_BASE         (0x40080000UL)
#define LPC_AHB_BASE          (0x50000000UL)
#define LPC_CM3_BASE          (0xE0000000UL)

/* APB0 peripherals                                                           */
#define LPC_WDT_BASE          (LPC_APB0_BASE + 0x00000)
#define LPC_TIM0_BASE         (LPC_APB0_BASE + 0x04000)
#define LPC_TIM1_BASE         (LPC_APB0_BASE + 0x08000)
#define LPC_UART0_BASE        (LPC_APB0_BASE + 0x0C000)
#define LPC_UART1_BASE        (LPC_APB0_BASE + 0x10000)
#define LPC_PWM1_BASE         (LPC_APB0_BASE + 0x18000)
#define LPC_I2C0_BASE         (LPC_APB0_BASE + 0x1C000)
#define LPC_SPI_BASE          (LPC_APB0_BASE + 0x20000)
#define LPC_RTC_BASE          (LPC_APB0_BASE + 0x24000)
#define LPC_GPIOINT_BASE      (LPC_APB0_BASE + 0x28080)
#define LPC_PINCON_BASE       (LPC_APB0_BASE + 0x2C000)
#define LPC_SSP1_BASE         (LPC_APB0_BASE + 0x30000)
#define LPC_ADC_BASE          (LPC_APB0_BASE + 0x34000)
#define LPC_CANAF_RAM_BASE    (LPC_APB0_BASE + 0x38000)
#define LPC_CANAF_BASE        (LPC_APB0_BASE + 0x3C000)
#define LPC_CANCR_BASE        (LPC_APB0_BASE + 0x40000)
#define LPC_CAN1_BASE         (LPC_APB0_BASE + 0x44000)
#define LPC_CAN2_BASE         (LPC_APB0_BASE + 0x48000)
#define LPC_I2C1_BASE         (LPC_APB0_BASE + 0x5C000)

/* APB1 peripherals                                                           */
#define LPC_SSP0_BASE         (LPC_APB1_BASE + 0x08000)
#define LPC_DAC_BASE          (LPC_APB1_BASE + 0x0C000)
#define LPC_TIM2_BASE         (LPC_APB1_BASE + 0x10000)
#define LPC_TIM3_BASE         (LPC_APB1_BASE + 0x14000)
#define LPC_UART2_BASE        (LPC_APB1_BASE + 0x18000)
#define LPC_UART3_BASE        (LPC_APB1_BASE + 0x1C000)
#define LPC_I2C2_BASE         (LPC_APB1_BASE + 0x20000)
#define LPC_I2S_BASE          (LPC_APB1_BASE + 0x28000)
#define LPC_RIT_BASE          (LPC_APB1_BASE + 0x30000)
#define LPC_MCPWM_BASE        (LPC_APB1_BASE + 0x38000)
#define LPC_QEI_BASE          (LPC_APB1_BASE + 0x3C000)
#define LPC_SC_BASE           (LPC_APB1_BASE + 0x7C000)

/* AHB peripherals                                                            */
#define LPC_EMAC_BASE         (LPC_AHB_BASE  + 0x00000)
#define LPC_GPDMA_BASE        (LPC_AHB_BASE  + 0x04000)
#define LPC_GPDMACH0_BASE     (LPC_AHB_BASE  + 0x04100)
#define LPC_GPDMACH1_BASE     (LPC_AHB_BASE  + 0x04120)
#define LPC_GPDMACH2_BASE     (LPC_AHB_BASE  + 0x04140)
#define LPC_GPDMACH3_BASE     (LPC_AHB_BASE  + 0x04160)
#define LPC_GPDMACH4_BASE     (LPC_AHB_BASE  + 0x04180)
#define LPC_GPDMACH5_BASE     (LPC_AHB_BASE  + 0x041A0)
#define LPC_GPDMACH6_BASE     (LPC_AHB_BASE  + 0x041C0)
#define LPC_GPDMACH7_BASE     (LPC_AHB_BASE  + 0x041E0)
#define LPC_USB_BASE          (LPC_AHB_BASE  + 0x0C000)

/* GPIOs                                                                      */
#define LPC_GPIO0_BASE        (LPC_GPIO_BASE + 0x00000)
#define LPC_GPIO1_BASE        (LPC_GPIO_BASE + 0x00020)
#define LPC_GPIO2_BASE        (LPC_GPIO_BASE + 0x00040)
#define LPC_GPIO3_BASE        (LPC_GPIO_BASE + 0x00060)
#define LPC_GPIO4_BASE        (LPC_GPIO_BASE + 0x00080)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define LPC_SC                ((LPC_SC_TypeDef        *) LPC_SC_BASE       )
#define LPC_GPIO0             ((LPC_GPIO_TypeDef      *) LPC_GPIO0_BASE    )
#define LPC_GPIO1             ((LPC_GPIO_TypeDef      *) LPC_GPIO1_BASE    )
#define LPC_GPIO2             ((LPC_GPIO_TypeDef      *) LPC_GPIO2_BASE    )
#define LPC_GPIO3             ((LPC_GPIO_TypeDef      *) LPC_GPIO3_BASE    )
#define LPC_GPIO4             ((LPC_GPIO_TypeDef      *) LPC_GPIO4_BASE    )
#define LPC_WDT               ((LPC_WDT_TypeDef       *) LPC_WDT_BASE      )
#define LPC_TIM0              ((LPC_TIM_TypeDef       *) LPC_TIM0_BASE     )
#define LPC_TIM1              ((LPC_TIM_TypeDef       *) LPC_TIM1_BASE     )
#define LPC_TIM2              ((LPC_TIM_TypeDef       *) LPC_TIM2_BASE     )
#define LPC_TIM3              ((LPC_TIM_TypeDef       *) LPC_TIM3_BASE     )
#define LPC_RIT               ((LPC_RIT_TypeDef       *) LPC_RIT_BASE      )
#define LPC_UART0             ((LPC_UART_TypeDef      *) LPC_UART0_BASE    )
#define LPC_UART1             ((LPC_UART1_TypeDef     *) LPC_UART1_BASE    )
#define LPC_UART2             ((LPC_UART_TypeDef      *) LPC_UART2_BASE    )
#define LPC_UART3             ((LPC_UART_TypeDef      *) LPC_UART3_BASE    )
#define LPC_PWM1              ((LPC_PWM_TypeDef       *) LPC_PWM1_BASE     )
#define LPC_I2C0              ((LPC_I2C_TypeDef       *) LPC_I2C0_BASE     )
#define LPC_I2C1              ((LPC_I2C_TypeDef       *) LPC_I2C1_BASE     )
#define LPC_I2C2              ((LPC_I2C_TypeDef       *) LPC_I2C2_BASE     )
#define LPC_I2S               ((LPC_I2S_TypeDef       *) LPC_I2S_BASE      )
#define LPC_SPI               ((LPC_SPI_TypeDef       *) LPC_SPI_BASE      )
#define LPC_RTC               ((LPC_RTC_TypeDef       *) LPC_RTC_BASE      )
#define LPC_GPIOINT           ((LPC_GPIOINT_TypeDef   *) LPC_GPIOINT_BASE  )
#define LPC_PINCON            ((LPC_PINCON_TypeDef    *) LPC_PINCON_BASE   )
#define LPC_SSP0              ((LPC_SSP_TypeDef       *) LPC_SSP0_BASE     )
#define LPC_SSP1              ((LPC_SSP_TypeDef       *) LPC_SSP1_BASE     )
#define LPC_ADC               ((LPC_ADC_TypeDef       *) LPC_ADC_BASE      )
#define LPC_DAC               ((LPC_DAC_TypeDef       *) LPC_DAC_BASE      )
#define LPC_CANAF_RAM         ((LPC_CANAF_RAM_TypeDef *) LPC_CANAF_RAM_BASE)
#define LPC_CANAF             ((LPC_CANAF_TypeDef     *) LPC_CANAF_BASE    )
#define LPC_CANCR             ((LPC_CANCR_TypeDef     *) LPC_CANCR_BASE    )
#define LPC_CAN1              ((LPC_CAN_TypeDef       *) LPC_CAN1_BASE     )
#define LPC_CAN2              ((LPC_CAN_TypeDef       *) LPC_CAN2_BASE     )
#define LPC_MCPWM             ((LPC_MCPWM_TypeDef     *) LPC_MCPWM_BASE    )
#define LPC_QEI               ((LPC_QEI_TypeDef       *) LPC_QEI_BASE      )
#define LPC_EMAC              ((LPC_EMAC_TypeDef      *) LPC_EMAC_BASE     )
#define LPC_GPDMA             ((LPC_GPDMA_TypeDef     *) LPC_GPDMA_BASE    )
#define LPC_GPDMACH0          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH0_BASE )
#define LPC_GPDMACH1          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH1_BASE )
#define LPC_GPDMACH2          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH2_BASE )
#define LPC_GPDMACH3          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH3_BASE )
#define LPC_GPDMACH4          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH4_BASE )
#define LPC_GPDMACH5          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH5_BASE )
#define LPC_GPDMACH6          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH6_BASE )
#define LPC_GPDMACH7          ((LPC_GPDMACH_TypeDef   *) LPC_GPDMACH7_BASE )
#define LPC_USB               ((LPC_USB_TypeDef       *) LPC_USB_BASE      )

/**
 * @}
 */

#endif  // __LPC17xx_H__
